my_website/app/views/students/show.html.erb

    </tr>
  <% AttendingCompany.all.each do |attending_company| %>
        <% if (attending_company.specialization == @student.specialization) && (VisitingCompany.where( :student_id => @student.id , :attending_company_id=>attending_company.id ).length==0) %>
---
SELECT "attending_companies".* FROM "attending_companies"
SELECT "visiting_companies".* FROM "visiting_companies" WHERE "visiting_companies"."student_id" = 1 AND "visiting_companies"."attending_company_id" = 1 LIMIT 1

    </tr>
    <% VisitingCompany.all.each do |visiting_company| %>
        <% if (visiting_company.student_id == @student.id) && (visiting_company.visited==false)&& AttendingCompany.find(visiting_company.attending_company_id).day1  %>
---
SELECT "visiting_companies".* FROM "visiting_companies"
SELECT "attending_companies".* FROM "attending_companies" WHERE "attending_companies"."id" = ? LIMIT 1  [["id", 6]]
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", "1"]]