my_website/app/views/visiting_companies/index.html.erb

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
SELECT "attending_companies".* FROM "attending_companies" WHERE "attending_companies"."id" = ? LIMIT 1  [["id", false]]
---
    <td><%= visiting_company.student_id %></td>
    <td><%= Student.find(visiting_company.student_id).name %></td>
    <td><%= visiting_company.attending_company_id %></td>
    <td><%= AttendingCompany.find(visiting_company.attending_company_id).name %></td>