my_website/app/views/visiting_companies/show.html.erb

SELECT "attending_companies".* FROM "attending_companies" WHERE "attending_companies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
---
  <b>Student:</b>
  <%= 'Successfully added ' + AttendingCompany.find(@visiting_company.attending_company_id).name + 'to student ' + Student.find(@visiting_company.student_id).name %>