my_website/app/controllers/attending_companies_controller.rb

SELECT "attending_companies".* FROM "attending_companies"
---
  def index
    @attending_companies = AttendingCompany.all

SELECT "attending_companies".* FROM "attending_companies" WHERE "attending_companies"."id" = ? LIMIT 1  [["id", "index"]]
---
  def show
    @attending_company = AttendingCompany.find(params[:id])

SELECT "attending_companies".* FROM "attending_companies" WHERE "attending_companies"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @attending_company = AttendingCompany.find(params[:id])

INSERT INTO "attending_companies" ("created_at", "day1", "day2", "name", "specialization", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Tue, 09 Oct 2012 00:32:22 UTC +00:00], ["day1", nil], ["day2", nil], ["name", nil], ["specialization", nil], ["updated_at", Tue, 09 Oct 2012 00:32:22 UTC +00:00]]
---
  def create
    @attending_company = AttendingCompany.new(params[:attending_company])

      if @attending_company.save

SELECT "attending_companies".* FROM "attending_companies" WHERE "attending_companies"."id" = ? LIMIT 1  [["id", "1"]]
---
  def update
    @attending_company = AttendingCompany.find(params[:id])

SELECT "attending_companies".* FROM "attending_companies" WHERE "attending_companies"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "attending_companies" WHERE "attending_companies"."id" = ?  [["id", 1]]
---
  def destroy
    @attending_company = AttendingCompany.find(params[:id])
    @attending_company.destroy