my_website/app/controllers/students_controller.rb

INSERT INTO "students" ("created_at", "name", "specialization", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 17 Sep 2012 15:35:46 UTC +00:00], ["name", "Venkatesh Sriram"], ["specialization", "Computer Science"], ["updated_at", Mon, 17 Sep 2012 15:35:46 UTC +00:00]]
---
  def create
    @student = Student.new(params[:student])
    @student.save

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "students" SET "specialization" = 'Electrical Engineering', "updated_at" = '2012-09-21 00:14:59.078113' WHERE "students"."id" = 3
---
  def update
    @student = Student.find(params[:id])

    respond_to do |format|
      if @student.update_attributes(params[:student])