my_website/app/controllers/visiting_companies_controller.rb

  def index
    @visiting_companies = VisitingCompany.all
---
SELECT "visiting_companies".* FROM "visiting_companies"

  def show
    @visiting_company = VisitingCompany.find(params[:id])
---
SELECT "visiting_companies".* FROM "visiting_companies" WHERE "visiting_companies"."id" = ? LIMIT 1  [["id", "2"]]

  def new
    u = VisitingCompany.new
    u.student_id = params[:student_id]
    u.attending_company_id = params[:company_id]
    u.visited = false;
    u.save
     respond_to do |format|
      format.html{redirect_to Student.find(u.student_id)} # new.html.erb
---
INSERT INTO "visiting_companies" ("attending_company_id", "created_at", "student_id", "updated_at", "visited") VALUES (?, ?, ?, ?, ?)  [["attending_company_id", nil], ["created_at", Wed, 19 Sep 2012 13:59:17 UTC +00:00], ["student_id", nil], ["updated_at", Wed, 19 Sep 2012 13:59:17 UTC +00:00], ["visited", nil]]
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @visiting_company = VisitingCompany.find(params[:id])
---
SELECT "visiting_companies".* FROM "visiting_companies" WHERE "visiting_companies"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @visiting_company = VisitingCompany.new(params[:visiting_company])

    respond_to do |format|
      if @visiting_company.save
---
INSERT INTO "visiting_companies" ("attending_company_id", "created_at", "student_id", "updated_at", "visited") VALUES (?, ?, ?, ?, ?)  [["attending_company_id", nil], ["created_at", Wed, 19 Sep 2012 14:30:42 UTC +00:00], ["student_id", nil], ["updated_at", Wed, 19 Sep 2012 14:30:42 UTC +00:00], ["visited", nil]]

  def update
    @visiting_company = VisitingCompany.find(params[:id])
    @visiting_company.visited = !@visiting_company.visited
    @visiting_company.save
    student_id = VisitingCompany.find(params[:id]).student_id
---
SELECT "visiting_companies".* FROM "visiting_companies" WHERE "visiting_companies"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "visiting_companies" SET "student_id" = 1, "attending_company_id" = 6, "visited" = 'f', "updated_at" = '2012-09-19 14:43:46.566821' WHERE "visiting_companies"."id" = 1
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]

  def destroy
    student_id = VisitingCompany.find(params[:id]).student_id
    @visiting_company = VisitingCompany.find(params[:id])
    @visiting_company.destroy
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
SELECT "visiting_companies".* FROM "visiting_companies" WHERE "visiting_companies"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "visiting_companies" WHERE "visiting_companies"."id" = ?  [["id", 3]]