my_website/app/controllers/visiting_companies_controller.rb

SELECT "visiting_companies".* FROM "visiting_companies" WHERE "visiting_companies"."student_id" IS NULL AND "visiting_companies"."attending_company_id" IS NULL
---
  def destroy
    #@visiting_company = VisitingCompany.where(:student_id => params[:student_id], :attending_company_id => params[:company_id])[0]
    @visiting_company = VisitingCompany.find(VisitingCompany.where(:student_id => params[:student_id], :attending_company_id => params[:company_id]).id)